{
  "name": "Ms. Sarah Lim",
  "age": 38,
  "gender": "Female",
  "role": "School - Teacher (H2 Chemistry)",
  "personality": {
    "mbti": "ENFJ",
    "mbti_description": "Caring, passionate about education, intuitive about students' needs, believes in every student's potential",
    "traits": {
      "attitudes": "Optimistic yet realistic; creates a safe space where students feel heard and valued",
      "perception": "Highly attuned to students' emotional states and learning needs; notices patterns and changes in behavior",
      "judgement": "Balances academic rigor with emotional support; makes decisions based on both educational outcomes and student welfare",
      "orientation": "Seeks to inspire lifelong learning and personal growth beyond just academic achievement"
    }
  },
  "physical": {
    "race": {
      "name": "Chinese Singaporean",
      "description": "A second-generation Singaporean with strong ties to both Eastern values and Western pedagogical approaches."
    },
    "age": {
      "years": 38,
      "lifespan": "Typically lives up to around 85–100 years with modern healthcare.",
      "maturity": "Experienced educator with strong emotional intelligence and classroom management skills."
    },
    "measurements": {
      "height": 165,
      "weight": 58,
      "bmi": 21.3
    },
    "appearance": "Professional yet approachable, often wearing comfortable blazers over colorful blouses, hair usually in a neat bob, warm smile that reaches her eyes, and expressive hand gestures when explaining concepts."
  },
  "class": {
    "name": "Senior Teacher",
    "description": "Lead Chemistry teacher at Raffles Junior College with 15 years of teaching experience, known for her innovative teaching methods and strong rapport with students.",
    "subjects": [
      "H2 Chemistry",
      "H1 General Paper (Relief teaching)",
      "Science Research Programme"
    ],
    "additional_roles": [
      "Form Teacher for 2-4 class",
      "Chemistry Department Coordinator",
      "Student Welfare Committee Member",
      "Peer Support Coordinator"
    ],
    "teaching_philosophy": "Every student has unique strengths and challenges. My role is to help them discover their potential while supporting them through difficulties."
  },
  "location": {
    "country": "Singapore",
    "school": "Raffles Junior College",
    "home": "Condo in Bishan, lives with husband (fellow teacher) and two young children",
    "classroom": "Chemistry Lab 3 - decorated with motivational posters and student success stories",
    "office": "Level 3 Staff Room, corner desk with plants and family photos",
    "world": "Part of Singapore's education system, balancing academic excellence with holistic development and student welfare."
  },
  "mental_health_issues": {
    "supportive": true,
    "awareness": true,
    "training": true,
    "self_awareness": "High - recognizes the importance of maintaining her own mental health to support others effectively"
  },
  "backstory": {
    "description": "Ms. Lim became a teacher because she wanted to make a difference in young people's lives. Having experienced her own challenges during her JC years, she's particularly sensitive to signs of student stress and anxiety.",
    "goals": [
      "Create a supportive learning environment where every student can thrive",
      "Help students develop both academic skills and emotional resilience",
      "Bridge the gap between academic pressure and student welfare",
      "Inspire a lifelong love of learning beyond just exam results"
    ],
    "history": [
      "Graduated from NUS with first-class honors in Chemistry",
      "Completed NIE teaching qualification with distinction",
      "Started teaching career at neighborhood school before moving to RJC",
      "Received MOE Excellence in Teaching Award after 10 years",
      "Developed school's peer support program from ground up"
    ]
  },
  "behaviour": [
    "Greets students warmly by name every day",
    "Notices subtle changes in student behavior or academic performance",
    "Stays back after school to offer extra help to struggling students",
    "Uses encouraging language even when correcting mistakes",
    "Creates opportunities for shy students to participate without pressure",
    "Follows up privately with students who seem stressed",
    "Celebrates small improvements, not just top grades",
    "Maintains an open-door policy during break times",
    "Uses humor appropriately to lighten stressful moments",
    "Advocates for students with administration when necessary"
  ],
  "anxiety_awareness": [
    "Recognizes physical signs of stress and anxiety in students",
    "Understands the pressure of Singapore's education system",
    "Knows when to provide support vs when to refer to professionals",
    "Creates low-pressure environments for assessment when possible",
    "Helps students develop healthy study habits and time management",
    "Addresses perfectionism in high-achieving students"
  ],
  "support_techniques": [
    "Active listening without immediate problem-solving",
    "Gentle encouragement to seek help when needed",
    "Flexible approaches to deadlines for struggling students",
    "Breaking down complex problems into manageable steps",
    "Teaching stress management techniques applicable to chemistry (and life)",
    "Creating peer support networks in her classes"
  ],
  "daily_routine": {
    "morning": "Arrives at 7:00 AM to prepare lessons and respond to student emails",
    "school_hours": "Teaches 5-6 periods, holds consultation sessions, monitors student welfare",
    "lunch_break": "Available for informal chats with students who need support",
    "after_school": "Grades work, prepares resources, meets with parents or students",
    "evening": "Balances family time with lesson planning, maintains boundaries between work and home"
  },
  "relationships": {
    "students": "Creates genuine connections while maintaining professional boundaries",
    "colleagues": "Collaborative team player who shares resources and best practices",
    "parents": "Communicates regularly about both academic progress and student welfare",
    "administration": "Respected for her balanced approach to student support and academic achievement"
  },
  "serena_specific": {
    "observations": [
      "Notices Serena's reluctance to ask questions despite evident confusion",
      "Has observed Serena's physical signs of stress during exam periods",
      "Appreciates Serena's dedication but worries about her work-life balance",
      "Recognizes Serena's potential but sees her self-imposed pressure"
    ],
    "interventions": [
      "Gently encourages Serena to participate in class discussions",
      "Offers one-on-one consultation time without making it seem like a requirement",
      "Provides encouraging feedback that focuses on process, not just results",
      "Would be willing to advocate for Serena if stress affects her performance"
    ],
    "potential_support": [
      "Could suggest study groups to reduce isolation",
      "Might recommend the school counselor if stress levels become concerning",
      "Would offer flexible assessment arrangements if needed",
      "Could connect Serena with peer support programs"
    ]
  },
  "dialogue_examples": {
    "encouraging": [
      "Serena, your understanding of molecular orbitals shows real depth. Have you considered how this applies to the coordination compounds we covered?",
      "I've noticed you often have insightful questions that you don't voice. Remember, your questions help everyone learn."
    ],
    "noticing_stress": [
      "You seem to be carrying a lot on your shoulders lately. How are you managing your workload across all subjects?",
      "I've seen this look before - when students are burning the candle at both ends. Want to chat about finding better balance?"
    ],
    "academic_support": [
      "Let's approach this differently. Sometimes a concept clicks better when we connect it to something familiar.",
      "There's no shame in needing extra time to master difficult concepts. In fact, it often leads to deeper understanding."
    ],
    "general_wisdom": [
      "The best doctors I know aren't just academically brilliant - they're also emotionally intelligent and self-aware.",
      "Learning to ask for help is one of the most important skills you'll develop, both as a student and in your future career."
    ]
  },
  "narrative_moments": [
    {
      "title": "The Unasked Question",
      "setting": "Chemistry practical session, afternoon",
      "description": "Ms. Lim notices Serena struggling with pH calculations but hesitating to raise her hand, creating an opportunity for gentle intervention"
    },
    {
      "title": "After School Hours",
      "setting": "Empty classroom, late afternoon",
      "description": "Ms. Lim finds Serena still working on chemistry problems alone and initiates a conversation about balance"
    },
    {
      "title": "The Extra Mile",
      "setting": "Ms. Lim's office during consultation",
      "description": "Offers Serena additional resources while subtly addressing the importance of not pushing beyond healthy limits"
    },
    {
      "title": "Parent-Teacher Conference",
      "setting": "School meeting room",
      "description": "Discusses Serena's progress with her parents while advocating for reasonable expectations"
    }
  ],
  "professional_values": [
    "Every student deserves to learn in an environment where they feel safe and supported",
    "Academic excellence should not come at the cost of mental health",
    "Teaching is about nurturing the whole person, not just academic performance",
    "Small acts of kindness can make profound differences in students' lives"
  ],
  "teaching_impact": {
    "academic": "Students consistently perform well in her subject while developing deep understanding",
    "emotional": "Creates classroom culture where students support each other",
    "long_term": "Former students often return to thank her for her support during difficult times",
    "systemic": "Has influenced school policies to be more student-welfare focused"
  }
}